/*
홀수인 자연수 n 이 주어졌을 때, 폭(가로)이 n 개의 문자로 만들어져 있고, 높이(세로)가 n 개의 줄로 만들어진 사각형 안에 아래 그림과 같은 모양의 다이아몬드를 출력하는 프로그램을 작성하 시오. 여기서, 정수 n 을 다이아몬드의 크기라고 부른다.
예를 들어, 아래 그림은 다이아몬드의 크기 n 가 각각 3, 5, 7, 그리고 9인 경우를 출력한 예이다.

표준입력(standard input)을 사용하여 다이아몬드의 크기를 나타내는 홀수인 자연수 n (3 ≤ n ≤ 99) 을 입력한다.

표준출력(standard output)을 사용하여 크기가 n 인 다이아몬드 모양을 출력한다. 다이아몬드 모 양은 각 줄의 제일 왼쪽부터 출력하여야 한다
*/


int main(void) {
    int a;

    cin >> a;
    
    for(int i=0;i<a;i++){
        int star =  i < a/2? (a-2*i-1)/2: i-a/2;  
        for(int j=0;j<star;j++) cout<< '*';
        for(int j=0;j<a-2*star;j++) cout<<'+';
        for(int j=0;j<star;j++) cout<< '*';
        cout<<endl;
    }
    
    return 0;
}